In [1]:
city=["Pune","Satara","Karad","Mumbai","kolhapur","Goa"]
city.insert(-1,"Data Science")
print(city)

['Pune', 'Satara', 'Karad', 'Mumbai', 'kolhapur', 'Data Science', 'Goa']

In [2]:
s=int(input("Enter the Position: "))
s2=input("Enter the City Name: ")
city.insert(s,s2)
print(city)

Enter the Position: 2
Enter the City Name: Belapur
['Pune', 'Satara', 'Belapur', 'Karad', 'Mumbai', 'kolhapur', 'Data Science', 'Goa']

In [3]:
a="1009ABC"
for x in a:
    print("Komal Kurhe")

Komal Kurhe
Komal Kurhe
Komal Kurhe
Komal Kurhe
Komal Kurhe
Komal Kurhe
Komal Kurhe

In [18]:
for x in range(1,6):
    for y in range(x):
        print('*',end=' ')
    print()

*
* *
* * *
* * * *
* * * * *

In [19]:
user=input("Enter the User Name: ")
if user=="Komal":
    pas=input("Enter the Passward: ")
    if pas=="123":
         print("Done it Sucussfully.....")
    
    else:
         print("Your Passward is Wrong")
else:
     print('Wrong User Name: ')

Enter the User Name: Komal
Enter the Passward: 123
Done it Sucussfully.....

In [20]:
user=input("Enter the User Name: ")
if user=="Komal":
    pas=input("Enter the Passward: ")
    if pas=="123":
         print("Done it Sucussfully.....")
    
    else:
         print("Your Passward is Wrong")
else:
     print('Wrong User Name: ')

Enter the User Name: Savi
Wrong User Name:

In [26]:
a=int(input("Enter the value: "))
b=int(input("enter the value: "))
if a==b:
    for x in range(10):
        print(x)

Enter the value: 11
enter the value: 11
0
1
2
3
4
5
6
7
8
9

In [33]:
m=int(input("Enter the marks: "))
if m>0 and m<35:
    print("fail")
elif m>=35 and m<60:
    print("Pass")
elif m>=60  and m<=100:
    print("Distinction")

Enter the marks: 89
Distinction

In [34]:
def profile():
    pro=[]
    name=input("Enter the Name: ")
    num=int(input("Enter the Number: "))
    Email=input("Enter the Email: ")
    city=input("Enter the City: ")
    pro.append(name)
    pro.append(num)
    pro.append(Email)
    pro.append(city)
    print("My Profile Details: ",pro)

In [35]:
profile()

Enter the Name: Komal
Enter the Number: 9767971466
Enter the Email: komalkurhe2017@gmail.com
Enter the City: Belapur
My Profile Details:  ['Komal', 9767971466, 'komalkurhe2017@gmail.com', 'Belapur']

In [62]:
import pandas as pd
import numpy as np

In [63]:
Dataset={'Name':['Komal','Riya','Savi','Divya','Ravi','Supriya','Sapana','Madhuri'], 
         'City':['Shrirampur','Sangali','Pune','Goa','Belapur','Satara','Nasik','Rahata'],
         'BOD':['5/1/2001','5/6/2003','23/3/2004','5/5/1999','5/2/2017','5/3/2019','5/1/2013','5/2/2015'],
         'Fav-Colour':['Pink','Black','Red','Orange','White','Yellow','Grey','Pink'],
         'Education':['B.Sc','M.Sc','BEd','M.CS','MCA','DEd','M.sc','B.sc'],
         'R.No':[11,12,10,9,13,15,1,16] }
df=pd.DataFrame(Dataset)
df

      Name        City        BOD Fav-Colour Education  R.No
0    Komal  Shrirampur   5/1/2001       Pink      B.Sc    11
1     Riya     Sangali   5/6/2003      Black      M.Sc    12
2     Savi        Pune  23/3/2004        Red       BEd    10
3    Divya         Goa   5/5/1999     Orange      M.CS     9
4     Ravi     Belapur   5/2/2017      White       MCA    13
5  Supriya      Satara   5/3/2019     Yellow       DEd    15
6   Sapana       Nasik   5/1/2013       Grey      M.sc     1
7  Madhuri      Rahata   5/2/2015       Pink      B.sc    16

In [65]:
csv_data = df.to_csv()

In [66]:
print(csv_data)

,Name,City,BOD,Fav-Colour,Education,R.No
0,Komal,Shrirampur,5/1/2001,Pink,B.Sc,11
1,Riya,Sangali,5/6/2003,Black,M.Sc,12
2,Savi,Pune,23/3/2004,Red,BEd,10
3,Divya,Goa,5/5/1999,Orange,M.CS,9
4,Ravi,Belapur,5/2/2017,White,MCA,13
5,Supriya,Satara,5/3/2019,Yellow,DEd,15
6,Sapana,Nasik,5/1/2013,Grey,M.sc,1
7,Madhuri,Rahata,5/2/2015,Pink,B.sc,16

In [67]:
df.pivot_table(index='Fav-Colour')

            R.No
Fav-Colour
Black       12.0
Grey         1.0
Orange       9.0
Pink        13.5
Red         10.0
White       13.0
Yellow      15.0

In [76]:
df.isnull().any()

Name          False
City          False
BOD           False
Fav-Colour    False
Education     False
R.No          False
dtype: bool

In [78]:
df.shape

(8, 6)

In [71]:
df.head()

    Name        City        BOD Fav-Colour Education  R.No
0  Komal  Shrirampur   5/1/2001       Pink      B.Sc    11
1   Riya     Sangali   5/6/2003      Black      M.Sc    12
2   Savi        Pune  23/3/2004        Red       BEd    10
3  Divya         Goa   5/5/1999     Orange      M.CS     9
4   Ravi     Belapur   5/2/2017      White       MCA    13

In [72]:
df.tail()

      Name     City       BOD Fav-Colour Education  R.No
3    Divya      Goa  5/5/1999     Orange      M.CS     9
4     Ravi  Belapur  5/2/2017      White       MCA    13
5  Supriya   Satara  5/3/2019     Yellow       DEd    15
6   Sapana    Nasik  5/1/2013       Grey      M.sc     1
7  Madhuri   Rahata  5/2/2015       Pink      B.sc    16

In [73]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   City        8 non-null      object
 2   BOD         8 non-null      object
 3   Fav-Colour  8 non-null      object
 4   Education   8 non-null      object
 5   R.No        8 non-null      int64
dtypes: int64(1), object(5)
memory usage: 512.0+ bytes

In [75]:
df.describe()

            R.No
count   8.000000
mean   10.875000
std     4.642582
min     1.000000
25%     9.750000
50%    11.500000
75%    13.500000
max    16.000000